# Pandas
---------------

## Instalação 
* conda install pandas
* pip install pandas

In [2]:
# Importação
import numpy as np
import pandas as pd

## Séries

In [ ]:
# Criando series com index padrão
notas= [8.5,7,9]
pd.Series(notas)

In [12]:
# Criando series com index definidos
notas= [8.5,7,9]
alunos = ['Aluno 1','Aluno 2','Aluno 3']
pd.Series(notas,alunos)

Aluno 1    8.5
Aluno 2    7.0
Aluno 3    9.0
dtype: float64

In [ ]:
# Usando numpy
notas2= np.array([6,7,8])
pd.Series(notas2)

# Mini Tarefa

* (a) Tente Criar uma série a partir de um dicionário Python;

In [ ]:
#Acessando Informações
ser1 = pd.Series([5,2,1],['Brasil','Argentina','França'])
print("O Brasil tem {} cinco copas do Mundo.".format(ser1['Brasil']))

In [11]:
# Acessando mais de uma chave 
# Você consegue identificar o Erro ?
ser2 = pd.Series(data=['França','Brasil','Argentina'],index=[98,2002,1986])
print("A França foi campeã em {}, o Brasil em {} e a Argentina em {}".format(ser2[[98,2002,1986]]))

IndexError: tuple index out of range

In [9]:
ser2[[98,2002,1986]]

98         França
2002       Brasil
1986    Argentina
dtype: object

In [ ]:
# Operações

In [13]:
nProva1 = pd.Series(data=[5,10,9], index=['AL01','AL02','AL03'])
nProva2 = pd.Series(data=[4,6,4], index=['AL01','AL02','AL03'])
somaProva = nProva1 + nProva2
somaProva 
# Algo estranho ?

AL01     9
AL02    16
AL03    13
dtype: int64

6.333333333333334

## Mini Tarefa

* (a) Calcule a Média da Turma;
* (b) Calcule a Média Ponderada da Turma, sendo o peso Prova1=2 e Peso Prova2=3);

In [3]:
# Caso não haja um total Match
nProva1 = pd.Series(data=[5,10,9,8], index=['AL01','AL02','AL03','AL04'])
nProva2 = pd.Series(data=[4,6,4], index=['AL01','AL02','AL03'])
nProva1 + nProva2

AL01     9.0
AL02    16.0
AL03    13.0
AL04     NaN
dtype: float64

### DataFrames

In [17]:
# Criando DFs
np.random.seed(100)
dados = np.random.rand(5,3)*10
colunas = ['P1','P2','P3']
index = ['AL01','AL02','AL03','AL04','AL05']
df = pd.DataFrame(dados,index,colunas)
df

            P1        P2        P3
AL01  5.434049  2.783694  4.245176
AL02  8.447761  0.047189  1.215691
AL03  6.707491  8.258528  1.367066
AL04  5.750933  8.913220  2.092021
AL05  1.853282  1.083769  2.196975

In [19]:
# Acessando Colunas
type(df['P1'])

# Qual o tipo da Coluna ?

pandas.core.series.Series

In [ ]:
# Outro tipo de Acesso
df.P1 #(Não Recomendado)

In [ ]:
# Acessando Mais de uma coluna
df[['P1','P2']]

In [ ]:
# Add nova coluna (Prova 4)
df['P4'] = np.random.rand(5)*10

In [ ]:
# Calculando a média
df['media'] = (df['P1'] + df['P2'] + df['P3'] + df['P4'])/4

# Outra forma

In [22]:
df

            P1        P2        P3
AL01  5.434049  2.783694  4.245176
AL02  8.447761  0.047189  1.215691
AL03  6.707491  8.258528  1.367066
AL04  5.750933  8.913220  2.092021
AL05  1.853282  1.083769  2.196975

In [27]:
df.mean(1)

AL01    4.154306
AL02    3.236880
AL03    5.444361
AL04    5.585391
AL05    1.711342
dtype: float64

## Mini Tarefa
* (a) Use df.mean para calcular a médias por Aluno e por disciplina

In [20]:
df.shape # axis 0 (linha) e 1 (coluna)

(5, 3)

In [ ]:
 # Removendo colunas
df2 = df.drop('media',axis=1)

In [ ]:
# Para excluir de Df
df.drop('media',axis=1,inplace=true)

## Mini Tarefa
* (a) Remova a linha do Aluno AL03 do DataFrame.

In [ ]:
# Selecionado linhas
df.loc['AL02']
# Qual o tipo do objeto ?

In [ ]:
# Por linha posição
df.iloc[1]

In [ ]:
# Selecionando Posição (linha e coluna)
df.loc['AL02']['P1']

In [ ]:
df.iloc[2]['P1']

In [ ]:
# SubDataFrames
df.loc[['AL02','AL03']][['P1','P2']]

In [ ]:
df.iloc[[1,4]][['P1','P2']]

## Seleção Condicional

In [ ]:
# Relembrando Numpy
df[df > 5]

In [ ]:
# Selecionando Alunos que tiveram nota acima da média em P1
mediaP1 = df['P1'].mean()
mediaP1

In [ ]:
df['P1'] > mediaP1

In [ ]:
df['P1']

In [ ]:
df[df['P1'] > mediaP1]

## Mini Tarefa
* Selecione os alunos que ficaram baixo da média;
* Calcule a média de P2 dos alunos abaixo da média.

AL02    3.236880
AL05    1.711342
dtype: float64

In [ ]:
# Ops não funciona (Normal and/or)
df[(df['P1']>5) and (df['P2']>5)]
df[(df['P1']>5) or (df['P2']>5)]

In [ ]:
df[(df['P1']>5) & (df['P2']>5)]

In [ ]:
df[(df['P1']>5) & (df['P2']>5)]

In [ ]:
df[(df['P1']>5) | (df['P2']>5)]

###  Reset de Index

In [ ]:
df.reset_index()

In [ ]:
# Novo Index
alunosMat = ['A01','A02','A03','A04','A05']
df['Mat'] = alunosMat
df.set_index('Mat')

### Index Hierárquico

In [42]:
#Criando o index
alunos = ['AL01','AL01','AL01','AL02','AL02','AL02']
provas =['P1','P2','P3','P1','P2','P3']
hier_index = list(zip(alunos,provas))
hier_index = pd.MultiIndex.from_tuples(hier_index)

# Criando os dados
np.random.seed(100)
notas = np.random.rand(6,3)*10

#Criando as colunas
disciplinas = ['D1','D2','D3']

# Criando o DataFrame
df2 = pd.DataFrame(notas,hier_index,disciplinas)
df2

               D1        D2        D3
AL01 P1  5.434049  2.783694  4.245176
     P2  8.447761  0.047189  1.215691
     P3  6.707491  8.258528  1.367066
AL02 P1  5.750933  8.913220  2.092021
     P2  1.853282  1.083769  2.196975
     P3  9.786238  8.116831  1.719410

In [41]:
np.random.seed(100)
notas = np.random.rand(6,3)*10

In [43]:
# Melhorando a Representação
df2.index.names = ['Aluno','Prova']
df2

                   D1        D2        D3
Aluno Prova
AL01  P1     5.434049  2.783694  4.245176
      P2     8.447761  0.047189  1.215691
      P3     6.707491  8.258528  1.367066
AL02  P1     5.750933  8.913220  2.092021
      P2     1.853282  1.083769  2.196975
      P3     9.786238  8.116831  1.719410

In [45]:
df2.loc['AL01'].loc['P1']

D1    5.434049
D2    2.783694
D3    4.245176
Name: P1, dtype: float64

## Mini Tarefa

* Repita o exercício acima para 03 Alunos, 02 Provas e 04 Disciplinas.

In [ ]:
# Acessando dados
#Notas Aluno 1
notas_aluno1 = df2.loc['AL01']
notas_aluno1

In [ ]:
# Descendo na Hierárquia
notas_aluno1_P2 = df2.loc['AL01'].loc['P1']
notas_aluno1_P2

## Mini Tarefa
Como podemos acessar em df2:
    * Nota Aluno 02, Prova 2 da Disciplina 02
    * Nota Aluno 01, Prova 1 da Disciplina 03

In [48]:
df2

                   D1        D2        D3
Aluno Prova
AL01  P1     5.434049  2.783694  4.245176
      P2     8.447761  0.047189  1.215691
      P3     6.707491  8.258528  1.367066
AL02  P1     5.750933  8.913220  2.092021
      P2     1.853282  1.083769  2.196975
      P3     9.786238  8.116831  1.719410

In [49]:
 # Usando xs (cross-section)
 #Selecionando por Aluno
df2.xs('AL01')

             D1        D2        D3
Prova
P1     5.434049  2.783694  4.245176
P2     8.447761  0.047189  1.215691
P3     6.707491  8.258528  1.367066

In [50]:
 # Usando xs (cross)
 # Selecionando por Prova   
df2.xs('P1',level='Prova')

             D1        D2        D3
Aluno
AL01   5.434049  2.783694  4.245176
AL02   5.750933  8.913220  2.092021

## Limpeza de Dados

In [51]:
dic3 = {'X':[1,np.nan,np.nan],'Y':[2,4,np.nan],'Z':[3,4,4],}
df3 = pd.DataFrame(dic3)
df3

     X    Y  Z
0  1.0  2.0  3
1  NaN  4.0  4
2  NaN  NaN  4

In [52]:
# Limpando por Linhas
df3.dropna()

     X    Y  Z
0  1.0  2.0  3

In [53]:
# Limpando por Colunas
df3.dropna(axis=1)

   Z
0  3
1  4
2  4

In [54]:
# Usando thresh
df3.dropna(thresh=2)

     X    Y  Z
0  1.0  2.0  3
1  NaN  4.0  4

In [55]:
# Preenchedo os Valores
print(df3)
df3.fillna(3)

     X    Y  Z
0  1.0  2.0  3
1  NaN  4.0  4
2  NaN  NaN  4

     X    Y  Z
0  1.0  2.0  3
1  3.0  4.0  4
2  3.0  3.0  4

In [ ]:
# Preenchedo cada Coluna com um valo
df3.fillna(pd.Series({'X':1,'Y':2,'Z':3}))

In [ ]:
# Preenchedo os Valores com a média
df3['Y'].fillna(df3['Y'].mean())

In [ ]:
# Preenchedo os Valores com a média em Todo df
df3.fillna(df3.mean())

In [ ]:
type(df3.mean())

### Agrupamento de Dados

In [56]:
dic4 = {'Metodo':['KNN','SVR','ANN','KNN','SVR','ANN'],
        'Cenario':['C1','C2','C1','C2','C1','C2'],
        'Erro':[2.1,2.1,1.5,1.7,1.8,1.9]}
df4 = pd.DataFrame(dic4)
df4

  Cenario  Erro Metodo
0      C1   2.1    KNN
1      C2   2.1    SVR
2      C1   1.5    ANN
3      C2   1.7    KNN
4      C1   1.8    SVR
5      C2   1.9    ANN

In [57]:
# Agrupando por cenário
byCen = df4.groupby('Cenario')

In [58]:
byCen.mean()

         Erro
Cenario
C1        1.8
C2        1.9

In [59]:
byCen.sum()

         Erro
Cenario
C1        5.4
C2        5.7

In [60]:
byCen.min()

         Erro Metodo
Cenario
C1        1.5    ANN
C2        1.7    ANN

In [61]:
byCen.max()

         Erro Metodo
Cenario
C1        2.1    SVR
C2        2.1    SVR

## Mini Tarefa
 * Use groupby e capture o erro médio das SVRs;
 * Chame describe() no grupo criado acima.

## Joins

In [62]:
dfj1 = pd.DataFrame({'A':['A0','A1','A2'],'B':['B0','B1','B2']},index=[0,1,2])
dfj1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2

In [ ]:
dfj1

In [63]:
dfj2 = pd.DataFrame({'A':['A3','A4','A5'],'B':['B3','B4','B5']},index=[3,4,5])
dfj2

    A   B
3  A3  B3
4  A4  B4
5  A5  B5

In [64]:
dfj3 = pd.DataFrame({'A':['A6','A7','A8'],'B':['B6','B7','B8']},index=[6,7,8])
dfj3

    A   B
6  A6  B6
7  A7  B7
8  A8  B8

In [65]:
#Juntando so  dataFrames
pd.concat([dfj1,dfj2,dfj3])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4
5  A5  B5
6  A6  B6
7  A7  B7
8  A8  B8

In [66]:
pd.concat([dfj1,dfj2,dfj3],axis=1)

     A    B    A    B    A    B
0   A0   B0  NaN  NaN  NaN  NaN
1   A1   B1  NaN  NaN  NaN  NaN
2   A2   B2  NaN  NaN  NaN  NaN
3  NaN  NaN   A3   B3  NaN  NaN
4  NaN  NaN   A4   B4  NaN  NaN
5  NaN  NaN   A5   B5  NaN  NaN
6  NaN  NaN  NaN  NaN   A6   B6
7  NaN  NaN  NaN  NaN   A7   B7
8  NaN  NaN  NaN  NaN   A8   B8

In [74]:
# Inner join
left = pd.DataFrame({'pais':['01','02','03'],'nome':['Brasil','França','China']})
right =  pd.DataFrame({'pais':['01','02','03'],'continente':['America do Sul','Europa','Asia']})
df5 = pd.merge(left,right,how='inner',on='pais')
df5

     nome pais      continente
0  Brasil   01  America do Sul
1  França   02          Europa
2   China   03            Asia

In [71]:
left = pd.DataFrame({'pais':['01','02','03'],'nome':['Brasil','França','China']})
left

     nome pais
0  Brasil   01
1  França   02
2   China   03

In [72]:
right =  pd.DataFrame({'pais':['01','02','03'],'continente':['America do Sul','Europa','Asia']})
right

       continente pais
0  America do Sul   01
1          Europa   02
2            Asia   03

In [75]:
#
left = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K0'],
                     'A':['A00','A10'],
                     'B':['B00','B10']})
right = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K1'],
                     'C':['C00','C11'],
                     'D':['D00','D11']})

df6 = pd.merge(left,right,how='inner',on=['key1','key2'])
df6

     A    B key1 key2    C    D
0  A00  B00   K0   K0  C00  D00

In [77]:
left = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K0'],
                     'A':['A00','A10'],
                     'B':['B00','B10']})
left

     A    B key1 key2
0  A00  B00   K0   K0
1  A10  B10   K1   K0

In [79]:
right = pd.DataFrame({'key1':['K0','K1'],
                     'key2':['K0','K1'],
                     'C':['C00','C11'],
                     'D':['D00','D11']})
right

     C    D key1 key2
0  C00  D00   K0   K0
1  C11  D11   K1   K1

In [80]:
df7 = pd.merge(left,right,how='right',on=['key1','key2'])
df7

     A    B key1 key2    C    D
0  A00  B00   K0   K0  C00  D00
1  NaN  NaN   K1   K1  C11  D11

In [81]:
df7 = pd.merge(left,right,how='outer',on=['key1','key2'])
df7

     A    B key1 key2    C    D
0  A00  B00   K0   K0  C00  D00
1  A10  B10   K1   K0  NaN  NaN
2  NaN  NaN   K1   K1  C11  D11

### Joining

In [82]:
left = pd.DataFrame({'A':['A0','A1'],
                     'B':['B0','B1']},index=['k0','k1'])
right= pd.DataFrame({'C':['C0','C1'],
                     'D':['D0','D1']},index=['k0','k1'])
left.join(right)

     A   B   C   D
k0  A0  B0  C0  D0
k1  A1  B1  C1  D1

In [83]:
left.join(right,how='outer')

     A   B   C   D
k0  A0  B0  C0  D0
k1  A1  B1  C1  D1

### Operações

In [84]:
df7 = pd.DataFrame({'A':[1,2,3,4],'B':[222,555,244,222],'C':['ab','cd','ef','gh']})
df7

   A    B   C
0  1  222  ab
1  2  555  cd
2  3  244  ef
3  4  222  gh

In [85]:
# Valores únicos
df7['B'].unique()

array([222, 555, 244], dtype=int64)

In [86]:
# Contando os valores únicos
len(df7['B'].unique())
# ou
df7['B'].nunique()

3

In [87]:
# Contando os valores únicos e desciminando
df7['B'].value_counts()

222    2
555    1
244    1
Name: B, dtype: int64

## Apply

In [89]:
def pot(x,n=2):
    return x**n

In [90]:
# Aplicando funções na coluna
df7['A'].apply(pot)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

In [91]:
# Aplicando funções na coluna 
df7['C'].apply(len)

0    2
1    2
2    2
3    2
Name: C, dtype: int64

In [92]:
# Aplicando expressões lmbdas
df7['A'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

## Ordenação

In [156]:
df7.sort_values('B')

   A    B   C
0  1  222  ab
3  4  222  gh
2  3  244  ef
1  2  555  cd

In [157]:
df7.sort_values(by='B')

   A    B   C
0  1  222  ab
3  4  222  gh
2  3  244  ef
1  2  555  cd